# Сгенерировано транслятором JS→R
# Лабораторная работа №3  |  Вариант 10
# ──────────────────────────────────────────────────

# Переменные: a1
# Переменные: a2
a1 <- 15
a2 <- 4
# Переменные: x
x <- 123.45
# Переменные: str
str <- "Привет мир"
# Переменные: sum
R1 <- a1 + a2
sum <- R1
R2 <- a1 > a2
if (!(R2)) goto_line_17
R3 <- a1 + a2
sum <- R3
goto(M2)
sum <- a2
# Начало процедуры square (уровень 1)
square <- function() {
  # Переменные: r
  R4 <- x * x
  r <- R4
  return(r)
  # Переменные: arr
  arr[1] <- 42
  R5 <- a1 + 1
  arr[(R5) + 1] <- 100

# ──────────────────────────────────────────────────
# Таблица меток:
#   M1 → строка 17
